package com.testsmirk.utils;

/**
 * Created by testsmirk on 2017/4/26.
 */
public class Strings {

    public static final String[] NAMES = {
            "白居易",
            "杜甫",
            "李白",
            "齐己",
            "韦应物"

    };
    public static final String[] CONTENTS = {
            "小伟毕业后顺利的进了一家软件公司，他天生就是干这行的料。不爱说话，不善于言谈，热衷于解决程序中的难题，程序员的这些标签都贴在了他的身上。?" +
                    "每次解决一个难题，小伟总习惯对着电脑傻笑一会。刚开始大家都以为他脑子有点问题，后来久了也就习惯了。?" +
                    "突然有一天，公司来了一名女程序员。在他看来她一点没有程序员的样貌，长发飘飘，一副大边框的眼镜里藏着一双美丽的大眼睛，连走路时身边带过来的风都夹着淡淡的清香。?" +
                    "她的位置被安排在了小伟边上，她向小伟问好同时对他笑了一下。?" +
                    "就这个很平常的举动让小伟有些不知所措，她的微笑足以埋没他当天发现的所有Bug。?" +
                    "美女是刚毕业的小妹妹，在工作中难免有很多问题需要问小伟，小伟总是很快的帮她解决了。美女进步很快，为了答谢这段时间来小伟对她的帮助，她请他吃了个饭。?" +
                    "饭桌上，几乎是美女一个在说话，或者说是美女在审问他，她问一句，他答一句。但小伟也是个男人，也有男人都有的想法，但却没有男子汉应该有的勇气，一直红着脸低头吃饭。最后忍不住想看她一眼，却差点噎着了。?" +
                    "生活又在平淡中过了半年，一个晚上，他依然一个人在办公室里加班。突然她给她打了个电话，她说她喝多了，让他去接她。?" +
                    "他见到她的时候，她是撑到了极限。如果他晚点到，她可能就睡地上了。?" +
                    "她刚问完她的地址，她就醉倒了。她吃力的扶着她上了出租车，这也许是他第一次能如此近距离的和美女接触，能如此近距离的味着长发的味道。他费了好大的劲终于把她弄到了屋里，他自己也累得倒在了她边上。房间很静，他能听到她的心跳，能感受到她呼吸的空气撞到他脸上……。?" +
                    "他感觉自己心跳的频率比处理线上支付系统的Bug跳得还要快，他想尝试靠近她一点。就在这时，她吐了出来，弄得两个人一身污垢。?" +
                    "他给自己和她简单擦了一下，然后他拿出了电脑继续写代码。本来三天的工作量，他一个晚上就写完了，效率高得连他自己都不敢相信。?" +
                    "第二天她醒后，连连说谢谢。她说她和男友分手了，心情不好，然后自己跑出去喝酒了，要不是他还真不知道会发生什么事。?" +
                    "这以后，他工作总是心不在焉了。终于，有一天，她要他帮忙解决一个难题。他很快帮她写过完了，他把他对她的喜欢写在了代码注释里，希望她能看到。除了这种方式，他找不出更好表达自己想法的办法了。可没想到那天她有事，代码直接被她提交了，上线后就再也没有改过这个地方。?" +
                    "他一直希望那些地方再出一个bug，让她重新再看到她写给她的心里话.?" +
                    "他等了几个月，发现她和之前没什么区别，后来他就离职了。公司给他涨了50%的工资都没能留下他。?" +
                    "后来的几年里，他又换了几家公司。?" +
                    "今年，他到一家大公司面试的时候，最后的技术总监问他干技术这么多年，最让他揪心的事是什么。?" +
                    "他把他的这个故事和面试官说了。?" +
                    "最后面试官问他这女孩子到现在有没有联系过你。?" +
                    "他摇了摇头。?" +
                    "面试官说了一句，你被录用了，这么多年，那女孩子都没有联系你，说明你写的代码很稳定。",
            "有一对情侣，男的非常懦弱，做什么事情之前都让女友先试。女友对此十分不满。一次，两人出海，返航时，飓风将小艇摧毁，幸亏女友抓住了一块木板才保住了两人的性命。女友问男友：“你怕吗？”男友从怀中掏出一把水果刀，说：“怕，但有鲨鱼来，我就用这个对付它。”女友只是摇头苦笑。不久，一艘货轮发现了他们，正当他们欣喜若狂时，一群鲨鱼出现了，女友大叫：“我们一起用力游，会没事的！”男友却突然用力将女友推进海里，扒着木板朝货轮游去，并喊道：“这次我先试！”女友惊呆了，望着男友的背影，感到非常绝望。鲨鱼正在靠近，可鲨鱼对女友不感兴趣而径直向男友游去，男友被鲨鱼凶猛地撕咬着，他发疯似地冲女友喊道：“我爱你！”女友获救了，甲板上的人都在默哀，船长坐到女友身边说：“小姐，他是我见过最勇敢的人。我们为他祈祷！”“不，他是个胆小鬼。”女友冷冷地说。“您怎么这样说呢？刚才我一直用望远镜观察你们，我清楚地看到他把你推开后用刀子割破了自己的手腕。鲨鱼对血腥味很敏感，如果他不这样做来争取时间，恐怕你永远不会出现在这艘船上。”“什么？”女友听到真相如同晴天霹雳，她悲痛欲绝，伤心无比，但她突然想到男友是学iOS的。只有学iOS的程序员才有这么高的觉悟,学iOS的同学品质优异，有强大的博学雅正融合的意识，并具备强大的心理承受能力，人文情怀，领袖气质，个个都是老师的好助手，同学的好伙伴",
            "山寺桃花始盛开",
            "长恨春归无觅处",
            "不知转入此中来",
            "山寺桃花始盛开",
            "一道残阳铺水中",
            "半江瑟瑟半江红",
            "可怜九月初三夜",
            "露似珍珠月似弓",
            "江南好，",
            "风景旧曾谙",
            "日出江花红胜火",
            "春来江水绿如蓝",
            "能不忆江南",
            "离离原上草",
            "离离原上草", "一岁一枯荣",
            "野火烧不尽", "春风吹又生",
            "远芳侵古道",
            "晴翠接荒城",
            "又送王孙去",
            "萋萋满别情"

    };


}
